app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-08-13 15:05:47.312514"], ["id", 1]]
---
	def update
	  @school_class = SchoolClass.find(params[:id])
	  @school_class.update(school_class_params(:title))